import React from 'react'
import styled from 'styled-components'
import logo from '../../../assets/logo/praram9-logo.svg'
import { useLiff } from 'react-liff-v2'
import { usePDPA } from '../../../hooks/hospitel'

export interface Props {
  onNextStep: () => void
}

const InsuranceInfo: React.FC<Props> = ({ onNextStep }) => {
  const { data, error, acceptTermAndCon } = usePDPA()

  const handleAccept = async () => {
    await acceptTermAndCon(data.type, data.version)
    onNextStep()
  }

  return (
    <div className="flex flex-col h-full p-4  bg-white text-gray-700">
      <div className="scroll-content">
        <img src={logo} alt="param9-logo" className="m-auto" height="90" width="90" />
        <h1 className="text-lg font-bold text-primary-700 text-center">หนังสือแสดงความยินยอมรับการรักษาเป็นผู้ป่วยในกรณีติดเชื้อไวรัสโคโรนา 2019</h1>

        <h2 className="text-sm mt-2 font-bold py-4">ส่วนที่ 1 ข้อมูลเกี่ยวกับสภาวะอาการของผู้ป่วยและการรักษา และแนวทางการบริหารจัดการของโรงพยาบาล</h2>

        <div className="flex flex-row">
          <p className="pl-1 text-xs">1.</p>
          <p className="pl-1 text-xs">
            ข้อมูลด้านแนวทางการรักษาของโรงพยาบาลพระรามเก้าอ้างอิงตามเอกสาร แนวทางเวชปฏิบัติ การวินิจฉัย การดูแลรักษาและการป้องกันการติดเชื้อในโรงพยาบาล กรณีโรคติดเชื้อไวรัสโคโรนา
            2019 (COVID-19) ของกระทรวงสาธารณสุขฉบับที่บังคับใช้ปัจจุบันล่าสุด และหรือกฎหมาย ระเบียบอื่นใดที่เกี่ยวข้องด้วย
          </p>
        </div>

        <div className="flex flex-row">
          <p className="pl-1 text-xs">2.</p>
          <p className="pl-1 text-xs">ข้อมูลด้านทรัพยากรของโรงพยาบาล</p>
        </div>
        <div className="flex flex-row pl-2">
          <p className="pl-1 text-xs">2.1</p>
          <p className="pl-1 text-xs">
            เนื่องด้วยสถานการณ์การแพร่ระบาดของโรค COVID-19 ทำให้โรงพยาบาลพระรามเก้ามีอัตราการครองเตียงที่สูงมาก และจำนวนเตียงว่างมีจำกัด
            ส่งผลให้มีการปรับใช้งานห้องพักผู้ป่วยเพื่อให้เพียงพอแก่การดูแลรักษาผู้ป่วย
          </p>
        </div>
        <div className="flex flex-row pl-2">
          <p className="pl-1 text-xs">2.2</p>
          <p className="pl-1 text-xs">เนื่องด้วยบริบทตามข้อ 1 ในการรับผู้ติดเชื้อ COVID-19 ไว้รักษาในโรงพยาบาลพระรามเก้า ข้าพเจ้าทราบและเข้าใจข้อมูลดังต่อไปนี้</p>
        </div>
        <div className="flex flex-row pl-4">
          <p className="pl-1 text-xs">2.2.1</p>
          <p className="pl-1 text-xs">
            ข้าพเจ้าได้รับการชี้แจงจากแพทย์ บุคคลากรทางการแพทย์อย่างชัดเจนถึงการวินิจฉัย แผนการรักษา รวมถึงผลดีผลเสียที่อาจเกิดขึ้น ทางเลือกอื่นที่เป็นไปได้
            โอกาสที่จะประสบความสำเร็จ ผลลัพธ์ที่เป็นไปได้ของการรักษา ข้าพเจ้ายินยอมเข้ารับการรักษาเป็นผู้ป่วยในโรงพยาบาล กรณีผู้ป่วยติดเชื้อไวรัสโคโรนา 2019 ตลอดจนปฏิบัติตามคำแนะนำ
            นโยบายของโรงพยาบาลทุกประการ
          </p>
        </div>
        <div className="flex flex-row pl-4">
          <p className="pl-1 text-xs">2.2.2</p>
          <p className="pl-1 text-xs">
            ข้าพเจ้ายินยอมโดยสมัครใจให้แพทย์ บุคลากรทางการแพทย์ ทำการตรวจรักษาหรือกระทำการใด ๆ ตามหลักวิชาชีพทางการแพทย์ ตลอดระยะเวลาที่ผู้ป่วยเป็นผู้ป่วยใน
            โดยจะต้องอธิบายข้อมูลรายละเอียด เปิดโอกาสให้ซักถามและให้ข้าพเจ้ายินยอมก่อนดำเนินการ
          </p>
        </div>
        <div className="flex flex-row pl-4">
          <p className="pl-1 text-xs">2.2.3</p>
          <p className="pl-1 text-xs">
            ข้าพเจ้าเข้าใจดีว่า ข้อมูลในการตรวจรักษาของข้าพเจ้าใช้เพื่อการตรวจวินิจฉัยและการรักษาของข้าพเจ้า ดังนั้นคณะแพทย์ พยาบาล และ / หรือบุคลากรทางการแพทย์โรงพยาบาล
            ที่เกี่ยวข้องกับการตรวจวินิจฉัยและการรักษาของข้าพเจ้ามีความจำเป็นในการเข้าถึงและหรือใช้ข้อมูลของข้าพเจ้า
          </p>
        </div>
        <div className="flex flex-row pl-4">
          <p className="pl-1 text-xs">2.2.4</p>
          <p className="pl-1 text-xs">
            ข้าพเข้าเข้าใจดีว่าจะถูกจัดให้อยู่ในห้องพักตามที่ว่างพร้อมรับผู้ป่วย และเหมาะสมกับการดูแลรักษาตามสภาวะและอาการของผู้รับบริการ โดยไม่สามารถเลือกประเภทห้องพัก
            หรือหอผู้ป่วยได้
          </p>
        </div>
        <div className="flex flex-row pl-4">
          <p className="pl-1 text-xs">2.2.5</p>
          <p className="pl-1 text-xs">
            ในกรณีที่จำเป็นต้องบริหารทรัพยากรเพื่อให้ทันต่อการดูแลรักษาผู้ป่วยโดยภาพรวม โรงพยาบาลอาจจะพิจารณาย้ายข้าพเจ้าไปยังสถานพยาบาลที่รัฐจัดให้ตามความเหมาะสมได้
          </p>
        </div>
        <div className="flex flex-row pl-2">
          <p className="pl-1 text-xs">2.3</p>
          <p className="pl-1 text-xs">ข้อมูลด้านการปฏิบัติตัวของผู้ป่วยที่ติดเชื้อไวรัสโคโรนา 2019 ในระหว่างการรับไว้รักษาในสถานพยาบาล</p>
        </div>
        <div className="flex flex-row pl-4">
          <p className="pl-1 text-xs">2.3.1</p>
          <p className="pl-1 text-xs">
            เนื่องจากโรคติดเชื้อไวรัสโคโรนา 2019 จัดเป็นโรคติดเชื้อร้ายแรง จึงต้องมีแนวทางการปฏิบัติระหว่างการดูแลรักษาที่ละเอียดรัดกุม
            เพื่อผลการรักษาที่ดีและเพื่อป้องกันการกระจายของเชื้อโรค
          </p>
        </div>
        <div className="flex flex-row pl-4">
          <p className="pl-1 text-xs">2.3.2</p>
          <p className="pl-1 text-xs">
            โรงพยาบาลมีกฎและข้อกำหนดที่ผู้ป่วยจะต้องปฏิบัติตามอย่างเคร่งครัด เช่น การปฏิบัติตัวระหว่างอยู่ในห้องพัก การดูแลตนเอง การวัดและบันทึกค่าต่าง ๆ
            เพื่อเฝ้าระวังความเปลี่ยนแปลงของอาการ
          </p>
        </div>

        <p className="pt-2 pl-1 text-xs">เอกสารประกอบการให้ข้อมูล : </p>
        <p className="pl-1 text-xs">
          1. ประกาศกระทรวงสาธารณสุข เรื่อง หลักเกณฑ์ วิธีการ และเงื่อนไขการกำหนดค่าใช้จ่ายในการดำเนินการผู้ป่วยฉุกเฉินโรคติดต่ออันตรายตามกฎหมายว่าด้วยโรคติดต่อ
          กรณีโรคติดเชื้อไวรัสโคโรนา 2019
        </p>
        <p className="pl-1 text-xs">2. กฎและข้อกำหนดที่ผู้ป่วยจะต้องปฏิบัติระหว่างการอยู่รักษาตัวในโรงพยาบาล </p>

        <h2 className="text-sm mt-2 font-bold pt-4">ส่วนที่ 1 ข้อมูลเกี่ยวกับสภาวะอาการของผู้ป่วยและการรักษา และแนวทางการบริหารจัดการของโรงพยาบาล</h2>
        <p className="pt-2 text-xs">
          ข้าพเจ้าได้รับคำอธิบายที่ครบถ้วนชัดเจน และเข้าใจข้อมูลเกี่ยวกับสภาวะอาการของผู้ป่วยและการรักษา และแนวทางการบริหารจัดการของโรงพยาบาลดังที่ได้ระบุไว้ในเนื้อหาส่วนที่ 1
          ข้างต้น เป็นอย่างดี
        </p>
        <p className="pt-2 text-xs">
          ข้าพเจ้าให้ความยินยอมโดยสมัครใจในการถูกรับไว้ในโรงพยาบาลพระรามเก้า เพื่อการรักษาโรคติดเชื้อไวรัสโคโรนา 2019 (COVID-19)
          และยินยอมโดยสมัครใจในการปฏิบัติตามกฎและข้อกำหนดของโรงพยาบาลทุกประการ
        </p>
        
        <button type="button" className={`w-full mt-4 self-end btn-primary btn`} onClick={handleAccept}>
          รับทราบ
        </button>
      </div>
    </div>
  )
}
export default InsuranceInfo
